Catalogs/гиг_ПредметыРасчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>гиг_ПредметыРасчета</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИндексЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Куратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаборПараметров</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гиг_ПараметрыПредметовРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Трудозатраты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводства</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтапПроизводстваПредставление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеЭтапаПроизводства</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭтапыПроизводства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НомерЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСледующегоЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЭтапа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияДлительностиЭтапа</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЕдиницыИзмеренияВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаршрутнаяКарта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.МаршрутныеКарты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/гиг_РасчетИзделийКлиент/Ext/Module.bsl
Процедура ПодобратьЗначенияПараметров(Форма) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Элементы.ДеревоЗначенийПараметров.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("ПредметРасчета", Элементы.ДеревоЗначенийПараметров.ТекущиеДанные.ПредметРасчета);
	
	ОткрытьФорму("Справочник.гиг_ЗначенияПараметровПредметовРасчета.Форма.ФормаПодбора", 
			ПараметрыФормы, 
			Форма, 
			Форма.УникальныйИдентификатор,,,, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

Процедура ПодобратьПредметыРасчета(Форма) Экспорт
	
	//++Гольм А.А. (Гигабайт) 10.04.2018 12:35:50
	ЭлементыДерева = Форма.ДеревоЗначенийПараметров.ПолучитьЭлементы();
	Если ЭлементыДерева.Количество() <> 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Уже выбран предмет расчета " + ЭлементыДерева[0].ПредметРасчета + "
		|Для выбора другого предмета расчета, необходимо сначала удалить выбранный";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	//--Гольм А.А. (Гигабайт) 10.04.2018 12:38:44
	
	ПараметрыФормы = Новый Структура;
	//++Гольм А.А. (Гигабайт) 10.04.2018 12:33:56
	// переделываем на другую логику, предмет расчета может быть выбран только один,
	// вариативность будет регулироваться добавлением элементов в справочник "Задачи проекта"
	//ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Истина);
	//--Гольм А.А. (Гигабайт) 10.04.2018 12:35:19
	
	
	ОткрытьФорму("Справочник.гиг_ПредметыРасчета.ФормаВыбора", 
			ПараметрыФормы, 
			Форма, 
			Форма.УникальныйИдентификатор,,,, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

Процедура УдалитьЗначение(Форма, ЗначенияПараметров) Экспорт
	
	Элементы = Форма.Элементы;
	
	Если Элементы.ДеревоЗначенийПараметров.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	БылоИзменение = Ложь;
	
	Для каждого ТекСтрока Из Элементы.ДеревоЗначенийПараметров.ВыделенныеСтроки Цикл
		
		ТекущиеДанные = Форма.ДеревоЗначенийПараметров.НайтиПоИдентификатору(ТекСтрока);
		Если ТекущиеДанные = Неопределено Тогда
			Продолжить;
		КонецЕсли; 
		
		Если Не ЗначениеЗаполнено(ТекущиеДанные.ЗначениеПараметра)
			И Не ЗначениеЗаполнено(ТекущиеДанные.Параметр) Тогда
			
			НайденныеСтроки = ЗначенияПараметров.НайтиСтроки(Новый Структура("ПредметРасчета", ТекущиеДанные.ПредметРасчета));
			Для каждого ТекСтрока Из НайденныеСтроки Цикл
				ЗначенияПараметров.Удалить(ТекСтрока);
				БылоИзменение = Истина;
			КонецЦикла;
			
		ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ЗначениеПараметра) Тогда
			
			НайденныеСтроки = ЗначенияПараметров.НайтиСтроки(Новый Структура("ПредметРасчета, ЗначениеПараметра", ТекущиеДанные.ПредметРасчета, ТекущиеДанные.ЗначениеПараметра));
			Для каждого ТекСтрока Из НайденныеСтроки Цикл
				ЗначенияПараметров.Удалить(ТекСтрока);
				БылоИзменение = Истина;
			КонецЦикла;
			
			Если БылоИзменение Тогда
				НайденныеСтроки = ЗначенияПараметров.НайтиСтроки(Новый Структура("ПредметРасчета", ТекущиеДанные.ПредметРасчета));
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрока = ЗначенияПараметров.Добавить();
					НоваяСтрока.ПредметРасчета = ТекущиеДанные.ПредметРасчета;
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла; 
	
	Если БылоИзменение Тогда
		Форма.Модифицированность = Истина;
		Форма.ОбновитьДеревоЗначенийНаКлиенте();
	КонецЕсли; 
	
КонецПроцедуры

Процедура ОбработкаВыбора(Форма, ЗначенияПараметров, ВыбранноеЗначение, ИсточникВыбора) Экспорт
	
	Если ИсточникВыбора <> Неопределено 
		И ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") 
		И ИсточникВыбора.ИмяФормы = "Справочник.гиг_ПредметыРасчета.ФормаВыбора" Тогда
		
		НайденныеСтроки = ЗначенияПараметров.НайтиСтроки(Новый Структура("ПредметРасчета", ВыбранноеЗначение));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			НоваяСтрока = ЗначенияПараметров.Добавить();
			НоваяСтрока.ПредметРасчета = ВыбранноеЗначение;
			
			Модифицированность = Истина;
			
			ТекущаяВетвь = Форма.ДеревоЗначенийПараметров.ПолучитьЭлементы().Добавить();
			ТекущаяВетвь.Представление  = ВыбранноеЗначение;
			ТекущаяВетвь.ПредметРасчета = ВыбранноеЗначение;
			ТекущаяВетвь.Оформление     = 1;
			
			Форма.ОбновитьДеревоЗначенийНаКлиенте();
			
		КонецЕсли; 
		
	ИначеЕсли ИсточникВыбора <> Неопределено 
		И ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") 
		И ИсточникВыбора.ИмяФормы = "Справочник.гиг_ЗначенияПараметровПредметовРасчета.Форма.ФормаПодбора" Тогда
		
		НайденныеСтроки = ЗначенияПараметров.НайтиСтроки(Новый Структура("ЗначениеПараметра", ВыбранноеЗначение));
		Если НайденныеСтроки.Количество() = 0 Тогда
			
			ПредметРасчета = Форма.Элементы.ДеревоЗначенийПараметров.ТекущиеДанные.ПредметРасчета;
			ВладелецВыбранного = гиг_РасчетИзделийВызовСервера.ПолучитьВладельцаЗначенияПараметраПредметаРасчета(ВыбранноеЗначение);
			
			ДобавитьСтроку = Истина;
			Для Каждого ТекСтрока Из ЗначенияПараметров Цикл
				Владелец = гиг_РасчетИзделийВызовСервера.ПолучитьВладельцаЗначенияПараметраПредметаРасчета(ТекСтрока.ЗначениеПараметра);
				Если ВладелецВыбранного = Владелец Тогда
					ТекСтрока.ЗначениеПараметра = ВыбранноеЗначение;
					ДобавитьСтроку = Ложь;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если ДобавитьСтроку Тогда
				НайденныеСтроки = ЗначенияПараметров.НайтиСтроки(Новый Структура("ПредметРасчета, ЗначениеПараметра", ПредметРасчета, ПредопределенноеЗначение("Справочник.гиг_ЗначенияПараметровПредметовРасчета.ПустаяСсылка")));
				Если НайденныеСтроки.Количество() = 0 Тогда
					НоваяСтрока = ЗначенияПараметров.Добавить();
				Иначе
					НоваяСтрока = НайденныеСтроки[0];
				КонецЕсли;
				НоваяСтрока.ПредметРасчета = ПредметРасчета;
				НоваяСтрока.ЗначениеПараметра = ВыбранноеЗначение;
			КонецЕсли;
			//НомерСтроки = гиг_РасчетИзделийВызовСервера.ИзменитьСтрокуВТаблице(ЗначенияПараметров, ВыбранноеЗначение);
			//Если НомерСтроки = Неопределено Тогда
			//	НоваяСтрока = ЗначенияПараметров.Добавить();
			//	НоваяСтрока.ПредметРасчета = ПредметРасчета;
			//Иначе
			//	НоваяСтрока = ЗначенияПараметров[НомерСтроки];
			//КонецЕсли;
			
			//НайденныеСтроки = ЗначенияПараметров.НайтиСтроки(Новый Структура("ПредметРасчета, ЗначениеПараметра", ПредметРасчета, ПредопределенноеЗначение("Справочник.гиг_ЗначенияПараметровПредметовРасчета.ПустаяСсылка")));
			//
			//Если НайденныеСтроки.Количество() = 0 Тогда
			//	НоваяСтрока = ЗначенияПараметров.Добавить();
			//	НоваяСтрока.ПредметРасчета = ПредметРасчета;
			//Иначе
			//	НоваяСтрока = НайденныеСтроки[0];
			//КонецЕсли;
			
			//НоваяСтрока.ЗначениеПараметра = ВыбранноеЗначение;
			
			Форма.Модифицированность = Истина;
			
			Форма.ОбновитьДеревоЗначенийНаКлиенте();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
